---
type: DeleteElements
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# DeleteElements

`Autodesk.Revit.DB.DeleteElements` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |